docs/about.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>About Me</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet"href="resources/org.css"type="text/css" /><header><a href="index.html">Home</a>&emsp;<a href="about.html">About Me</a>&emsp;<a href="https://github.com/abdrysdale/abdrysdale.github.io">Source</a>&emsp;<a href="sitemap.html">Sitemap</a>&emsp;<a href="feed.xml">RSS</a></header>
</head>
<body>
<div id="content" class="content">
<h1 class="title">About Me</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge327991">Education</a></li>
<li><a href="#org5565c19">Papers</a></li>
<li><a href="#org220ddaa">Conferences</a></li>
</ul>
</div>
</div>
<p>
I'm currently a trainee Magnetic Resonance Physicist for NHS Wales working with <code>Python</code>, <code>Elisp</code>, <code>SQL</code> and big magnets.
</p>

<p>
Outwith employment, I dabble in many programming languages - mainly <code>Forth</code>, <code>Common Lisp</code>, <code>R</code>, <code>Fortran</code> and <code>Perl</code>.
</p>

<p>
In addition to turning coffee into bugs, I read a lot and bake bread.
</p>
<div id="outline-container-orge327991" class="outline-2">
<h2 id="orge327991">Education</h2>
<div class="outline-text-2" id="text-orge327991">
<dl class="org-dl">
<dt>Physics BSc</dt><dd>University of Glasgow -First Class Honours</dd>
<dt>PhD (candidate)</dt><dd>Swansea University - Deep Residual Graph Convolutional Neural Networks for Real Time Uncertainty Quantification of 1D Haemodynamic Vessel System Metrics</dd>
</dl>
</div>
</div>
<div id="outline-container-org5565c19" class="outline-2">
<h2 id="org5565c19">Papers</h2>
<div class="outline-text-2" id="text-org5565c19">
<ul class="org-ul">
<li><a href="https://doi.org/10.48550/arXiv.2411.09046">A new computational model for quantifying blood flow dynamics across myogenically-active cerebral arterial networks - A Coccarelli, I Polydoros, A Drysdale, OF Harraz, C Kadapa</a></li>
<li><a href="https://doi.org/10.1038/s41598-024-72832-y">Development of non-invasive biomarkers for pre-eclampsia through data-driven cardiovascular network models - Claudia Popp, Jason M Carson, Alex B Drysdale, Hari Arora, Edward D Johnstone, Jenny E Myers, Raoul van Loon</a></li>
</ul>
</div>
</div>
<div id="outline-container-org220ddaa" class="outline-2">
<h2 id="org220ddaa">Conferences</h2>
<div class="outline-text-2" id="text-org220ddaa">
<dl class="org-dl">
<dt>UK Association for Computational Mechanics, 2022</dt><dd>Neural Network Solvers from Synthetically Generated Data</dd>
<dt>BioMedEng, 2022</dt><dd>Physics Informed 1D Haemodynamic Neural Network Solvers</dd>
<dt>European Society of Mechanical Engineering, 2023</dt><dd>Deep Residual Ambivalent Graph-convolutional Neural Networks (DRAGNN) for Biomarker Prediction in Large Vessel Networks</dd>
<dt>BioMedEng, 2023</dt><dd>Machine Learning for Large Vessel Networks</dd>
</dl>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-04-19 Sat 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
</div>
</body>
</html>
